contact_list/app/controllers/projects_controller.rb

SELECT * FROM `projects` WHERE (project_name != ':public') ORDER BY project_name LIMIT 0, 12
---
  def index
    @order_by = params[:order_by] || 'project_name'
    @projects = Project.paginate :page=>params[:page], :per_page=>12, :order=>@order_by, :conditions=>"project_name != '#{Project::DEFAULT}'"

SELECT * FROM `projects` WHERE (project_name != ':public')
---
  def project_list
    @projects = Project.all :conditions=>"project_name != '#{Project::DEFAULT}'"