contact_list/app/controllers/staffs_controller.rb

SELECT * FROM `projects` WHERE (project_name != ':public') LIMIT 1
SELECT * FROM `groups` WHERE (`groups`.project_id = 2)
SELECT * FROM `staffs` WHERE (group_id IN(2,3,4)) ORDER BY en_firstname LIMIT 0, 12
---
  def index
    if params[:group_id] then
      @group = '=' + params[:group_id]
    else
      unless params[:project_id] && project = Project.find(params[:project_id])
        project = Project.find :first, :conditions=>"project_name != '#{Project::DEFAULT}'"
      end
      if project && groups = project.groups
        @group = 'IN(' + groups.map {|g| g.id}.join(',') + ')'
      else
        @group = 'is null'
      end
    end

    @order_by = params[:order_by] || 'en_firstname'

    @staffs = Staff.paginate :conditions=>"group_id #{@group}", :page=>params[:page], :per_page=>12, :order=>@order_by

SELECT * FROM `staffs` WHERE (`staffs`.`id` = 3)
---
  def show
    @staff = Staff.find(params[:ids])

SELECT * FROM `staffs` WHERE (en_lastname!=':default')
---
  def edit
    @staff = Staff.find(params[:ids])

INSERT INTO `staffs` (`team_id`, `office_phone`, `longtop_email`, `skype`, `passport`, `role2_id`, `site_id`, `photo_file_name`, `dob`, `updated_at`, `photo_file_size`, `ggroup_id`, `role1_id`, `svn_account`, `product_id`, `username`, `photo_updated_at`, `group_id`, `en_firstname`, `en_lastname`, `wave_id`, `base_mobile`, `report_to`, `photo_content_type`, `cn_firstname`, `current_mobile`, `s1_eamil`, `msn`, `base_id`, `onsite_mobile`, `password`, `cn_lastname`, `dept_id`, `created_at`) VALUES(5, '', '', '', '', 30, 34, NULL, '2010-03-17', '2010-03-17 02:33:51', NULL, 2, 29, '', 35, '', NULL, 2, 'Test', 'Test', 2, '', NULL, NULL, 'Test', '', '', '', 21, '', '', 'Test', 18, '2010-03-17 02:33:51')
---
  def create
    params.delete 'project'
    @staff = Staff.new(params[:staff])

    respond_to do |format|
      if @staff.save

SELECT * FROM `staffs` WHERE (`staffs`.`id` = 3)
UPDATE `staffs` SET `report_to` = 2, `updated_at` = '2010-03-17 02:38:31' WHERE `id` = 3
---
  def update
    @staff = Staff.find(params[:ids])

    respond_to do |format|
      if @staff.update_attributes(params[:staff])