app/controllers/groups_controller.rb

  def index
    @order_by = params[:order_by] || 'group_name'
    @groups = Group.paginate :page=>params[:page], :per_page=>12, :include=>:project, :order=>@order_by, :conditions=>"group_name != '#{Group::DEFAULT}'"
---
SELECT * FROM `groups` WHERE (group_name != ':public') ORDER BY group_name LIMIT 0, 12

  def show
    @group = Group.find(params[:ids])
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)

  def edit
    @group = Group.find(params[:ids])
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 2)

  def create
    @group = Group.new(params[:group])

    respond_to do |format|
      if @group.save
---
INSERT INTO `groups` (`group_name`, `project_id`, `updated_at`, `group_desc`, `created_at`) VALUES('Longtop', 2, '2010-03-07 07:42:31', 'Longtop group in the Kbank project', '2010-03-07 07:42:31')

  def update
    @group = Group.find(params[:ids])

    respond_to do |format|
      if @group.update_attributes(params[:group])
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 2)
UPDATE `groups` SET `updated_at` = '2010-03-16 13:35:01', `group_name` = 'S One' WHERE `id` = 9

  def destroy
    Group.destroy params[:id].split(',')
---
DELETE FROM `groups` WHERE `id` = 5